Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: གང་ཚེ་སྤོབས་པའི་དབྱངས་ཞེས་བྱ། །འཇིག་རྟེན་མགོན་པོ་བྱུང་བར་གྱུར། །
en: There once was a protector of the world Who was known by the name of Melodious Eloquence.

source: དེ་ཡི་གསུང་རབ་དག་ལ་ནི། །དགེ་སློང་ཆོས་འཛིན་མཁས་པ་བྱུང་། །
en: “A monk who was a skilled holder Of that buddha’s teachings

source: དེ་ཡིས་ཏིང་འཛིན་འདི་བཤད་པ། །
en: Explained this absorption,

source: རྒྱལ་པོའི་བུ་དེས་མཉན་ནས་ནི། །
en: And a prince listened.

source: དེ་ཡི་གོས་ཀྱང་བསྐོན་བྱས་ཏེ། །
en: “He offered his garments to the monk,

source: ཡོངས་སུ་བསྔོ་བ་བྱས་ནས་ཀྱང་། །
en: And made a dedication.

source: མགོན་པོ་སངས་རྒྱས་དེས་མཐོང་ནས། །
en: Thus, he beheld the protectors, the buddhas,

source: ཚེ་དཔག་མེད་པ་བྱང་ཆུབ་འཐོབ། །
en: And achieved awakening as Amitāyus.

source: སྔོན་གང་ལས་རྣམས་བྱས་གྱུར་པའི། །དེ་ཡི་རྣམ་པར་སྨིན་པ་དག །
en: “The ripening of the karma Committed in the past

source: ཡེ་ཤེས་ཕུང་པོ་འདི་ཐོས་པས། །མ་ལུས་པར་ནི་ཐམས་ཅད་ཟད། །
en: Is all brought to exhaustion Upon hearing this mass of wisdom.

source: གཞན་ཡང་སངས་རྒྱས་དྲི་མེད་ཟླས། །ཏིང་ངེ་འཛིན་ནི་བཤད་པ་ན། །
en: “Also, when the buddha Stainless Moon Taught this meditative absorption,

source: ཚོང་དཔོན་བུ་ཡིས་མཉན་ནས་ནི། །
en: A merchant son listened,

source: ཁྱིམ་དག་སྤངས་ནས་ངེས་བྱུང་སྟེ། །
en: Abandoned his household, and went forth.

source: གཉིད་དང་འདོད་པ་མེད་གྱུར་ཅིང་། །
en: “Relinquishing sleep and pleasures,

source: མཆིལ་ལྷམ་བགོས་པར་མ་གྱུར་པར། །
en: He refrained from wearing shoes,

source: དེ་ཡིས་ལོ་ནི་སྟོང་ཕྲག་བཅུར། །ཏིང་ངེ་འཛིན་ནི་བསྒོམ་པ་བྱས། །
en: And cultivated this absorption For ten thousand years.

source: འདི་ཐོས་ཙམ་གྱི་མོད་ལ་ནི། །
en: “Just by hearing this,

source: བྱང་ཆུབ་མཆོག་ནི་ཐོབ་འགྱུར་ཏེ། །
en: He immediately attained supreme awakening,

source: ཕྱིར་ཞིང་ཁྱིམ་ནོར་འདོད་པ་དང་། །
en: Never looking back at the household, wealth, or pleasures,

source: ལོངས་སྤྱོད་དག་ལ་དགའ་མ་གྱུར། །
en: And having no fondness for enjoyments.

source: སངས་རྒྱས་མཐའ་ཡས་དེས་མཐོང་ནས། །
en: “He beheld infinite buddhas

source: ཐམས་ཅད་དག་ལ་ཡོངས་ཞུས་ཏེ། །
en: And received teachings from them all.

source: དེ་ཡིས་ཚུལ་ཀུན་འཛུག་པ་ནི། །
en: Entering all the ways of the teachings,

source: མྱུར་བར་རྗེས་སུ་རྟོགས་པར་གྱུར། །
en: He quickly realized them all.

source: ཏིང་འཛིན་འདི་ལ་སྦྱོར་བྱེད་དེས། །
en: “Practicing this absorption,

source: ཡིད་དུ་འཐད་ཅེས་བྱ་བ་ཡིན། །
en: He has become known as Reasoning Mind.

source: བསམ་པ་ཡོངས་སུ་རྫོགས་མཛད་པ། །
en: Perfecting all intentions,

source: བྱང་ཆུབ་དེ་ནི་མྱུར་དུ་འཐོབ། །
en: He has attained swift awakening.

source: ཕྱི་མའི་དུས་ན་འབྱུང་བ་ནི། །
en: “When in future times

source: ཡེ་ཤེས་ཕྱག་རྒྱ་འདི་མཉན་ཀྱང་། །
en: People listen to this seal of wisdom,

source: ལོངས་སྤྱོད་མེད་ཅིང་བདེ་བ་མེད། །
en: They may feel no enjoyment or happiness,

source: རབ་ཏུ་བྱུང་བར་འདུན་པའང་མེད། །
en: Nor any wish to go forth.

source: གཅིག་ལ་གཅིག་ནི་སྤྱོ་བ་དང་། །གཤེ་བ་དང་ནི་བསྡིགས་པ་དང་། །སྨོད་པ་དག་ནི་སྒྲོགས་བྱེད་ཀྱང་། །སངས་རྒྱས་འགྱུར་བར་བྱ་ཞེས་ཟེར། །
en: “They may revile, Abuse, threaten, And disparage one another, Yet still they will declare, ‘I shall become a buddha.’

source: ཁྱིམ་ན་སྡུག་བསྔལ་སྟོང་ཡོད་པ། །
en: “Those who have thousands of miseries in their home,

source: བཟོད་འགྱུར་འདོད་པའི་རྒྱུ་དག་ལས། །
en: Yet still accept this as they consider the conditions of desire,

source: ལྟོས་ནས་ཉོན་མོངས་བྲན་གྱུར་ཀྱང་། །
en: Are slaves of their own negative emotions,

source: སངས་རྒྱས་འགྱུར་བར་བྱ་ཞེས་ཟེར། །
en: And still they declare, ‘I shall become a buddha.’

source: དེ་དག་གི་ནི་རྨི་ལམ་དུ། །སངས་རྒྱས་མཐོང་ནས་དབུགས་འབྱིན་ཅིང་། །
en: “In their dreams they will behold Buddhas and receive assurance.

source: མངོན་པའི་ང་རྒྱལ་འབྱུང་གཞན་ཡང་། །
en: They will thereby become filled with arrogating pride

source: ང་ལ་བྱང་ཆུབ་ཐེ་ཙོམ་མེད། །
en: And think, ‘There is no doubt that I am awakened.’

source: དོན་ཕྱིར་མ་ཡིན་དེ་དག་གིས། །མདོ་འདི་སྒྲ་ཙམ་མཉན་ནས་ཀྱང་། །
en: “Yet when such mistaken people Merely hear the words of this discourse,

source: དབུགས་དག་འབྱིན་བྱེད་བདག་གིས་ནི། །
en: They will receive joyous relief

source: རིང་པོར་མི་ཐོགས་བྱང་ཆུབ་འཐོབ། །
en: And understand, ‘Soon I will attain awakening.’

source: དེ་ཡིས་ཡང་དག་ཚུལ་འདི་ནི། །ཇི་བཞིན་ཐོས་ཤིང་མཉན་བྱས་ཀྱང་། །
en: “Upon hearing and listening correctly To this genuine way,

source: འཛིན་མེད་ཕྱིར་ཞིང་ཆགས་མེད་པ། །
en: They become free from grasping and attachment,

source: བར་སྣང་གི་ནི་རླུང་བཞིན་ནོ། །
en: Like the wind that moves in the sky.

source: འདི་ལ་མང་པོ་ཁ་ཅིག་དག །
en: “There are many others

source: བྱང་ཆུབ་དོན་ཕྱིར་རབ་བྱུང་ཡང་། །
en: Who may go forth for the sake of awakening,

source: ཕན་ཚུན་ཤེས་ཁེའི་གཞི་དག་ལས། །
en: Yet engage in arguments with each other

source: ཉེས་པ་དག་ནི་སྐྱེད་པར་འགྱུར། །
en: And thereby develop flaws.

source: ཤིན་ཏུ་དབུལ་ཞིང་ཤེས་རབ་དམན། །
en: “Destitute and with poor understanding,

source: ཐོས་པ་ཙམ་གྱིས་ང་རྒྱལ་ཅན། །
en: Based on hearing alone, they grow arrogant.

source: གཞན་ལ་སྙེམས་པར་བྱེད་པ་དེས། །
en: Feeling superior to others,

source: བདག་གིས་བྱང་ཆུབ་མཐར་ཕྱིན་སྙམ། །
en: They think, ‘I have reached perfect awakening.’

source: སྐུ་གདུང་རྙེད་དང་འོད་མཐོང་དང་། །
en: “They discover relics, behold lights,

source: རྒྱལ་བ་མཆོད་པས་སྤུ་ཟིང་བྱེད། །
en: And with their hair standing on end worship the victors.

source: བྱང་ཆུབ་ཐོབ་པར་ཤེས་འགྱུར་བས། །
en: With meager knowledge about the attainment of awakening,

source: ཆུང་ཟད་ཙམ་གྱིས་ངོ་མཚར་བྱེད། །
en: They nonetheless provoke great astonishment.

source: བྱང་ཆུབ་ཤིན་ཏུ་རིང་གྱུར་པའི། །
en: “Such people are exceedingly far from awakening,

source: གང་དེའི་གཡོ་འདི་དག་གིས་ཀྱང་། །
en: And through their deceptions,

source: ཉམས་པར་བྱས་ནས་
en: They will suffer further decline—

source: ཕྱིར་ཞིང་ནི། །དེ་ཡི་རྒྱལ་བ་ཤིན་ཏུ་རིང་། །
en: They are exceedingly far from victory.

source: མདོ་འདི་དག་ནི་མཉན་ནས་ཀྱང་། །
en: “As they hear this discourse,

source: བྱང་ཆུབ་ཐོབ་པར་འགྱུར་ཤེས་ཤིང་། །
en: They come to know of those who will attain awakening,

source: ཚེ་དཔག་མེད་གྱུར་བལྟ་བྱ་སྙམ། །
en: And consequently they may think, ‘I should behold Amitāyus,’

source: མྱུར་དུ་སངས་རྒྱས་བལྟ་བྱ་སྙམ། །
en: Or ‘I must soon see a buddha.’

source: དམིགས་པ་དག་ལ་གནས་པ་ཡི། །
en: “Mired in such apprehensions,

source: བྱང་ཆུབ་ཤིན་ཏུ་རིང་བ་སྟེ། །
en: They are exceedingly far from awakening.

source: ཡང་དག་མཐའ་ལ་གང་མི་བརྩོན། །
en: Those who do not strive toward the limit of reality

source: དེ་དག་ལ་ནི་ལུང་མི་བསྟན། །
en: Do not receive any prophesy.

source: ཚོང་དཔོན་གྱི་ནི་བུ་འདི་ཡིས། །ནོར་མཛོད་གང་ཡིན་བཏང་མཐོང་ནས། །
en: “This merchant son Gave up his lucrative business,

source: དེ་དག་རབ་ཏུ་བྱུང་ནས་ཕྱིས། །
en: And having gone forth,

source: སློངས་མོ་སྟེར་བའི་ཁྱིམ་ལ་ཆགས། །
en: He thenceforth adhered to the homes of almsgivers.

source: འདི་འདྲའི་ཏིང་ངེ་འཛིན་ནི་གང་། །
en: “Absorptions such as this

source: མར་མེ་མཛད་ལས་ངས་སྔོན་ཐོས། །
en: I have heard of from Dīpaṅkara.

source: ཡང་དག་པ་ནི་མི་ཤེས་པ། །
en: Those lacking knowledge of reality

source: དེ་ནི་གང་ཡང་འབྱུང་མི་འགྱུར། །
en: Will achieve nothing at all.

source: རིན་ཆེན་རིན་ཐང་མེད་འདོད་ཕྱིར། །རྒྱ་མཚོར་ཤ་ནའི་ཁུར་ཁྱེར་ལྟར། །
en: “Like someone who carries a load of hemp to sea, Wishing for a priceless jewel,

source: བླུན་པོ་དེ་དག་རབ་བྱུང་ནས། །ཤེས་ཁེའི་མཆོག་ལ་རག་ལས་སོ། །
en: Such fools may have gone forth, But they only resort to the highest form of exploitation.

source: འདི་ལ་ཐོས་དང་ཚུལ་ཁྲིམས་དང་། །རབ་ཏུ་བྱུང་བས་དག་མི་འགྱུར། །
en: “Here learning, discipline, and going forth Are not sufficient for purification.

source: བྱང་ཆུབ་ལམ་ནི་བསྒྲུབས་འདི་ལ། །
en: To accomplish the path of awakening,

source: བག་ཡོད་པར་ནི་གནས་པར་གྱིས། །
en: One must remain careful.

source: ཕྱི་མའི་དུས་ན་གང་ཞིག་གིས། །བཤད་པའི་ཚེ་ན་མཉན་ནས་ཀྱང་། །
en: “In the future there will be people Who will listen to such explanations,

source: དེ་ཉིད་ལ་ནི་རྙེད་པའི་རྒྱུས། །ཕྱིར་ཞིང་མི་སྙན་པ་དག་ཟེར། །
en: But they will use them for making profits And will speak offensively.

source: མདུན་ནས་ཀྱང་ནི་ཕྱག་འཚལ་ལ། །ལེགས་སོ་ཞེས་ནི་སྦྱིན་བྱེད་ཅིང་། །
en: “There will be people who publicly Offer prostrations and donations they call ‘auspicious,’

source: དེ་ལ་ཆོས་གོས་འབུལ་བྱེད་ཀྱང་། །མི་སྙན་པ་དག་ཟེར་བར་འགྱུར། །
en: As well as dharma robes, But who nevertheless speak offensively.

source: མཆི་མ་དག་ཀྱང་བླགས་བྱས་ཤིང་། །
en: “They may shed tears

source: བདག་ཉིད་དབུལ་བ་བྱས་ནས་ཀྱང་། །
en: And humble themselves,

source: དགེ་འདུན་ནང་དུ་དེ་ལ་ནི། །སྡིག་པ་བྱེད་ཅེས་ཕྱིར་ཞིང་སྨྲ། །
en: But later they will gossip That there are evildoers within the saṅgha.

source: སློབ་དཔོན་ལ་ནི་མཆོད་མི་བྱེད། །
en: “They will not pay respect to their teachers

source: བླ་མ་དག་ལ་རི་མོ་མེད། །
en: Or venerate their masters.

source: ཆུང་ཟད་ཙམ་གྱིས་ཁྲོ་བྱེད་ཅིང་། །
en: They will grow angry at the slightest provocation

source: ཁྱིམ་སུན་འབྱིན་དང་ལྡན་པ་ཡིན། །
en: And destroy even their own homes.

source: ཕ་རོལ་བསོད་ནམས་མ་དད་ཅིང་། །
en: “They will have no faith in the merits of others

source: རང་གི་སྐྱོན་ལ་མི་སེམས་པར། །
en: And pay no attention to their own faults.

source: གཞན་གྱི་མཆོད་པ་ཤེས་ནས་ནི། །
en: When they come to know of the offerings received by others,

source: ཕྲག་དོག་མི་བཟད་སྐྱེད་པར་བྱེད། །
en: It will cause them terrible envy.

source: བདག་གིས་གདུགས་དང་རྒྱལ་མཚན་དང་། །ཆོས་གོས་དང་ནི་མེ་ཏོག་གིས། །སྐུ་གདུང་དག་ནི་མཆོད་བྱས་ནས། །
en: “They will say, ‘By worshiping physical remains With parasols, banners, Dharma robes, and flowers,

source: བྱང་ཆུབ་ཐོབ་པར་འགྱུར་ཞེས་ཟེར། །
en: I shall attain awakening.’

source: བདེ་བ་ཐམས་ཅད་སྤང་བྱས་ཏེ། །
en: Give up all pleasures

source: བསྒྲུབ་པ་དག་ལ་གནས་པ་ནི། །
en: And adhere to the practices

source: ང་ཡི་ཡང་དག་མཆོད་འདི་ཡིན། །
en: That offer me true worship.

source: དཔེར་ན་རབ་འབྱོར་མཆོད་བྱེད་ལྟར། །
en: “For example, it is like the worship of Subhūti:

source: བདག་གི་ཕུང་པོ་སྤངས་ནས་ཀྱང་། །
en: Having renounced his own aggregates,

source: ཆོས་ཉིད་དེ་ལ་མཆོད་བྱེད་ཀྱི། །
en: He worshiped the natural state—

source: སྐུ་གདུང་གཟུགས་ལ་ཅི་ཞིག་མཆོད། །
en: What is the point of worshiping physical remains?

source: མདོ་འདི་སྒོམ་པར་བྱེད་པ་ན། །
en: “When you meditate on this discourse

source: སྲོག་ལ་དགའ་བ་སྤང་བྱ་སྟེ། །
en: You should give up fondness for your own life,

source: དགོན་པར་རྟག་ཏུ་གནས་བྱ་ཞིང་། །
en: Always adhere to solitude,

source: འཚོ་བའི་འཇིག་རྟེན་ཟད་པར་བྱ། །
en: And be done with the world of livelihood.

source: མཆོག་དགའ་རྒྱལ་པོ་ང་ལས་ནི། །བསྒྲུབ་པ་དག་ནི་མཉན་ནས་ཀྱང་། །
en: “Prāmodyarāja, once you have heard Of these accomplishments explained by me,

source: མི་དང་ལྷན་ཅིག་རྒྱུ་བ་ན། །ནམ་ཡང་ཡིད་བརྟན་མི་བྱ་སྨྲ། །
en: You should never place your trust in people As you move among them.

source: འདི་བདེན་འདི་ནི་མི་བདེན་ཞེས། །བདག་སྨྲ་བ་ན་དེ་དག་ནི། །
en: “When these people proclaim a self, Saying, ‘this is true, that is untrue,’

source: དགའ་བས་མི་སྙན་རྗོད་བྱེད་པ། །དེ་ཚེ་བདག་ནི་ཉམས་པར་འགྱུར། །
en: They enjoy saying such unpleasant things, But on these occasions, they just debase themselves.

source: བྱང་ཆུབ་མཆོག་ལ་ཕྱིར་ཞིང་ནི། །ཤེས་ཁེའི་སྤྱོད་ཡུལ་འདུན་པ་མེད། །
en: “Those who have no concern for supreme awakening, Except as a means of exploitation,

source: དེ་དག་བྱང་ཆུབ་བཀུར་སྟི་ཅན། །
en: May seem respectful of awakening,

source: དེ་དག་རྣམ་གྲོལ་ཤིན་ཏུ་རིང་། །
en: But they are exceedingly far from liberation.

source: སྡོམ་པས་བསྒྲུབས་ཏེ་ངས་ཐོབ་པ། །
en: “The attainments I have accomplished through vows,

source: ང་ཡི་བདག་ཉིད་ཆེན་པོ་དང་། །
en: My great true subjectivity,

source: རྫུ་འཕྲུལ་གང་ཡང་རུང་བ་དག །
en: And any miraculous abilities—

source: འདི་དག་ཐམས་ཅད་འདིར་མཐོང་ངམ། །
en: Are all these things seen here?

source: ཤེས་ཀྱི་ཁེ་དང་རྙེད་སྤངས་ནས། །
en: “Give up worldly profits and wealth

source: རི་དགས་བཞིན་དུ་དགོན་པ་ན། །
en: And remain in meditative seclusion

source: དབེན་པ་དག་ཏུ་བསྟེན་གྱིས་ཏེ། །
en: In the forest hermitage, like a deer.

source: ས་དང་ཚུལ་ཁྲིམས་གཟུངས་རྣམས་སྤྱོད། །
en: Engage in the spiritual levels, disciplines, and retentions.

source: བདེན་མིན་ངས་ནི་མ་སྨྲས་པ། །
en: “I do not proclaim what is untrue,

source: ཁྱོད་ལ་བྱིན་གྱིས་བརླབ་བྱ་སྟེ། །
en: But I give you spiritual blessings,

source: ཕྱི་དུས་མི་བཟད་པ་ཡི་ཚེ། །
en: So that in the terrible times of the future

source: མདོ་སྡེ་འདི་ཡང་ཁྱོད་ལ་ནི། །
en: This discourse will be there for you.

source: ཚེ་དཔག་མེད་དང་འཇིག་རྟེན་མགོན། །
en: “As in the case of Amitāyus, Lokanātha,

source: མི་འཁྲུགས་དེ་བཞིན་འོད་ཟེར་གཏོང་། །
en: And Akṣobhya, who all shine with light,

source: དེ་ལ་བྱེ་བ་དྲུག་ཅུ་པོ། །
en: Have you seen all the six hundred million

source: སངས་རྒྱས་འཁོར་བཅས་ཀུན་མཐོང་ངམ། །
en: Buddhas with their retinues?

source: སྟོན་པ་འཁོར་བཅས་དེ་དག་ནི། །
en: “Those teachers and their retinues

source: ཕྱི་མའི་དུས་ན་ཆོས་ཀྱང་སྐྱོང་། །
en: Will uphold the Dharma in the future.

source: མདོ་འདི་ཆོས་ཀྱི་ཕྱག་རྒྱ་སྟེ། །
en: This discourse is the seal of Dharma.

source: ཕྱི་མའི་ཚེ་ན་བསྒྲུབ་པར་འགྱུར། །
en: In the future it will be accomplished.

source: ཡོངས་སུ་གཏད་པ་འདི་མཉན་ཚེ། །
en: “When the teaching was entrusted and received

source: སྟོང་གསུམ་དག་ཀྱང་གཡོས་གྱུར་ཏེ། །
en: The trichiliocosm shook,

source: ལྷ་ཡིས་ལེགས་སོ་ཞེས་བྱིན་ཞིང་། །
en: The gods called out ‘Bravo!’

source: མེ་ཏོག་མང་པོའི་ཆར་པ་བབ། །
en: And let a rain of flowers fall.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་དང་ལྷན་ཅིག་ཏུ་ལུས་འདར་ལ་མཆི་མ་ཟག་ཅིང་སྐྱི་བུང་ཞེས་བྱེད་ལ། མཆན་ཁུང་ནས་རྔུལ་བྱུང་བཞིན་དུ་སྟན་ལས་ལངས་ཏེ
en: At that point the bodhisattva Prāmodyarāja, along with thirty thousand other bodhisattvas, rose from their seats, trembling, tearful, frightened, and with sweat emerging from their armpits.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་ཚིག་འཐུན་པར་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They rose, joined their palms in veneration, and facing in the direction of the Blessed One, they all spoke with one voice:

source: བཅོམ་ལྡན་འདས་སླད་མའི་དུས་ན་བརྡེག་འཚོག་ལ་ཉེ་བར་གནས་པ་དང་། ཆོས་སྨྲ་བ་ལ་བརྙས་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་མཆིས་པ་དང་།
en: “In the future time of repression—when Dharma teachers are disparaged and the wisdom of omniscience is denied,

source: བསྟན་པ་འཇིག་པ་དང་ཡེ་ཤེས་མཐོང་བ་ཆུང་བ་དང་།
en: when the teachings are destroyed and the vision of wisdom is slight,

source: ཆོས་དཀར་པོ་རྣམ་པར་གཞིག་པ་དང་། འཚོ་བའི་མཐར་གྱུར་པ་དེའི་ཚེ་ན་ལུས་དང་སྲོག་ཡོངས་སུ་བཏང་སྟེ
en: when virtuous factors disintegrate and the means of livelihood vanish —we shall relinquish concern for our own body and life,

source: བདེ་བར་གྲགས་པ་ཐམས་ཅད་བདག་གིས་རལ་གྲི་ལྟ་བུས་གཅད་པར་བགྱི་ཞིང་།
en: and cut through all that is held to be pleasurable, as if with a sword.

source: དེ་བཞིན་གཤེགས་པའི་ལམ་གཏེར་སྣ་ཚོགས་པ་སྤོབས་པ་ཕྱིན་ཅི་མ་ལོག་པ་ཕྱག་རྒྱ་དགེ་བའི་རྩ་བ་ལེགས་པར་སྡུད་པའི་རྒྱ་མཚོ་གཟུངས་ཀྱི་རིགས་བདུད་ཟིལ་གྱིས་གནོན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བསྒྲུབ་པ་ལ་རྗེས་སུ་རྟོགས་པའི་མདོ་སྡེ་འདི་དང་འདི་ལྟ་བུ་དག་བྲིས་ནས་འཆང་བ་དང་སྟོན་པར་བགྱིད་ལགས་སོ། །
en: The path of the thus-gone ones, the seal of the flawless rich treasures of eloquence, the ocean that brings together the roots of virtue, and the retentions that subdue the māras and accomplish omniscience are conveyed in discourses such as this one. We hereby pledge to write them down, carry them, and teach them at that time.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་སེམས་ཅན་དམྱལ་བ་ན་མཆིས་སུ་ལགས་ཀྱང་། ཏིང་ངེ་འཛིན་རིན་པོ་ཆེ་འདིའི་སླད་དུ་ནི་སྤྲོ་བར་བགྱིད་ལགས་སོ། །
en: Blessed One, even if it means living in hell, we shall do so happily for the sake of this precious absorption.”

source: འཇིག་རྟེན་མགོན་པོ་མ་གཏོགས་པར། །དཔང་གཞན་སུ་ཡང་མ་མཆིས་ན། །
en: “Except for the world’s protector I have no other witness.

source: ཅི་ནས་བྱང་ཆུབ་བདག་འདུན་དང་། །
en: I aspire to awakening with whatever it takes—

source: བདག་གི་བསམ་པ་མཁྱེན་ལགས་སམ། །
en: Are you aware of my intention?

source: རྒྱལ་བ་སླད་དུས་འཇིགས་ཆེན་ཚེ། །
en: “Victorious One, even if In the future time of terror

source: བདག་གི་ལུས་དང་སྲོག་དག་ནི། །མ་ལུས་པར་ནི་སྤངས་གྱུར་ཀྱང་། །
en: I must fully relinquish my body and life,

source: ཏིང་ངེ་འཛིན་འདི་གཟུང་བར་བགྱི། །
en: I shall uphold this absorption.

source: གལ་ཏེ་བསྐལ་པ་ཚད་མེད་པར། །སེམས་དམྱལ་གནས་ན་མཆིས་གྱུར་ཀྱང་། །ཏིང་ངེ་འཛིན་འདི་འཆང་བ་ན། །རྟག་ཏུ་དེ་ལ་སྤྲོ་བར་བགྱི། །
en: “Even if my mind must remain in hell Throughout infinite eons, I shall always do so happily If I hold to this absorption.

source: སེམས་ཅན་ཐམས་ཅད་གཉེར་ནས་ནི། །
en: “For the sake of all beings

source: ཟང་ཟིང་མ་མཆིས་ཆོས་བསྟན་བགྱི། །
en: I shall teach the Dharma free from materialistic concerns.

source: འདུ་བྱེད་ཐམས་ཅད་སྤངས་ནས་ཀྱང་། །
en: Giving up all acts of gathering,

source: སྲོག་ཆགས་རྣམས་ཀྱི་དོན་དག་བགྱི། །
en: I shall accomplish the objectives of living beings.

source: སླད་དུས་ཉེ་བར་གནས་པ་ན། །
en: “In times to come

source: བདག་གི་ལུས་སྲོག་རུས་པ་དང་། །ཤ་དང་ཆུ་རྒྱུས་ཞིག་ཀྱང་རུང་། །བདག་གིས་ལེ་ལོ་མི་བགྱིའོ། །
en: I will sacrifice my body and life, My bones, flesh, and veins, Rather than succumbing to laziness.

source: བཤེས་འདྲིན་ཐམས་ཅད་སྤངས་ནས་ནི། །
en: “Leaving behind all friends and acquaintances

source: དགོན་གནས་དག་ཏུ་མཆི་བགྱི་ཞིང་། །
en: I shall stay in the wilderness,

source: བྱམས་པས་སེམས་ཅན་ཁྱབ་བགྱི་སྟེ། །
en: Embrace all beings with love,

source: ནད་མེད་འགྱུར་བའི་སྨན་སྩལ་བགྱི། །
en: And dispense the medicine that cures all ills.

source: སྤྱོད་ཡུལ་ལོག་པ་གང་དེ་དག །དེ་དག་གི་ནི་མི་བསླབ་ཅིང་། །
en: “I shall avoid training In any mistaken domains,

source: ཅི་ནས་མདོ་འདི་སྤྱད་པ་ཡང་། །ཡང་དག་ཇི་བཞིན་སྤྱད་པར་བགྱི། །
en: And instead correctly engage In this discourse by all means.

source: ཇི་ལྟར་སངས་རྒྱས་མཁྱེན་པ་ལྟར། །
en: “As the buddhas know,

source: རྟག་ཏུ་བག་མཆིས་པར་ཡང་བགྱི། །
en: I shall remain careful.

source: འདི་ལ་ཐོག་མར་མཆི་བ་དག །
en: Firstly, wherever I may be,

source: སེམས་ཅན་རྣམས་ལའང་སྤྲོ་བར་བགྱི། །
en: I shall delight sentient beings.

source: ཞུགས་ཀྱི་ཕུང་པོར་མཆོངས་ཀྱང་རུང་། །
en: “Even if I must jump into masses of fire

source: འཇིགས་ཆེན་སྨན་ཆོས་འཚལ་ཀྱང་རུང་། །
en: I shall keep pursuing the Dharma that cures all terror.

source: གྲགས་པ་དང་ནི་མཆོད་སླད་དུ། །བྱང་ཆུབ་མཆོག་མ་སྟོན་མི་བགྱིད། །
en: Yet never will I teach about supreme awakening For the sake of fame and veneration.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། གང་གཱའི་ཀླུང་བདུན་ཅུའི་བྱེ་མ་དང་མཉམ་པའི་སེམས་ཅན་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ནས་ལྷགས་ཏེ། དེ་དག་གིས་འདི་ཐོས་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: When this teaching of the Dharma was given, as many sentient beings as there are grains of sand in seventy Gaṅgās, who had arrived from innumerable world realms, all proceeded irreversibly to unexcelled and perfect awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ཐོབ་བོ། །
en: The thousands of bodhisattvas likewise all attained this absorption.

source: ཕྱི་མའི་ཚེ་ན་གང་དག་ཆོས་སྨྲ་བ་ལྷ་འབུམ་ཕྲག་བཅུ་པོ་དེ་དག་ཀྱང་སྤྲོ་བར་མཛད་ནས་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: The teaching brought delight to one million gods, future teachers of the Dharma, who thus proceeded irreversibly to awakening.

source: ལྷ་དུང་ཕྱུར་ཕྲག་བདུན་པོ་དག་ཀྱང་གང་དག་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ། །
en: Seven billion gods purified the Dharma eye that regards all phenomena.

source: འཁོར་བཞི་པོ་མིའི་སྐྱེ་དགུ་བྱེ་བ་ཕྲག་བཅྭ་བརྒྱད་པོ་དག་གིས་ཀྱང་གང་དག་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་སྐྱེས་སོ། །
en: One hundred and eighty million members of the fourfold retinue of humans attained the Dharma eye that regards all phenomena.

source: ངན་སོང་གསུམ་པོ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །
en: All of the three lower realms were thoroughly pacified.

source: བཅོམ་ལྡན་འདས་ཀྱི་འོད་ཀྱིས་ཀྱང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་དག་ཏུ་སྣང་བར་གྱུར་ཏོ། །
en: The light of the Blessed One lit up as many world realms in the ten directions as there are grains of sand in the Gaṅgā.

source: དེའི་མོད་ལ་སྲིད་པའི་རྩེ་མོ་ནས་མནར་མེད་པའི་བར་གྱི་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གྱུར་ཏོ། །
en: At that moment happiness came to all sentient beings, from the summit of existence down to the Hell of Ultimate Torment.

source: བཅོམ་ལྡན་འདས་ཀྱི་འོད་དེ་ལས་རིན་པོ་ཆེ་བཀོད་པ་མཐའ་ཡས་པའི་པད་མ་འདབ་མ་འབུམ་ཡོད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བྱུང་བར་གྱུར་ནས།
en: Out of the Blessed One’s light appeared trillions of lotuses, each with a hundred thousand petals and adorned with infinite jewels.

source: པད་མ་ཐམས་ཅད་ལ་ཡང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཇི་ལྟ་བ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པ་རྣམས་འཁོར་དེ་ལྟ་བུ་དག་དང་བཞུགས་ཏེ།
en: Upon each of those flowers was a thus-gone one, just like the blessed Śākyamuni, surrounded by his retinue.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཡང་ཐམས་ཅད་ལ་གསོལ་བ་འདེབས་ལ། སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་བཀའ་སྩལ་ནས།
en: Each of them received the supplication of Prāmodyarāja, and each one consequently taught this absorption,

source: སེམས་ཅན་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་མཛད་དོ། །
en: allowing innumerable sentient beings to proceed irreversibly to unexcelled and perfect awakening.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་སྟོན་པ་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This was the first chapter, titled “Purifying Activity: The Teaching on Taking Up the Activities of the Bodhisattvas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then said this to the bodhisattva Prāmodyarāja:

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་ལྟ་བས་ན་སྦྱིན་པ་ལྷུར་མ་བྱེད་པར། ཆོས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ནི་མཆོད་པ་གྱིས་ཤིག །
en: “Prāmodyarāja, in this way you must devote yourself to generosity and make offerings to the Dharma.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་མང་པོ་དག་བྱུང་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་སྡུག་མཛེས་པ་རྣམ་པར་ངེས་པའི་འོད་ཀྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ
en: Prāmodyarāja, long ago, many incalculable eons in the past, there was a thus-gone one, a worthy one, a complete and perfect buddha known as Golden Beauty, King of the Splendid Light of Ascertainment.

source: སྐུ་ཚེའི་ཚད་ནི་དཔག་ཏུ་མེད་དོ། །
en: His lifespan was unfathomable,

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་ནི་མཐའ་ཡས་སོ། །
en: the features of his buddhafield were infinite,

source: འཁོར་ནི་གྲངས་མེད་དོ། །
en: and his retinue was beyond count.

source: ཕྱི་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མའི་ཚེ་དེའི་ཆོས་སྨྲ་བ་རིན་པོ་ཆེའི་ལུས་མཐའ་ཡས་པར་གྲགས་པ་སྤྱོད་པའི་མཛོད་ཅེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: “Later, during the final five hundred years of the teachings, there appeared a Dharma teacher by the name of Treasury of Engagement with the Infinite Jewel Body of Renown.

source: དེ་ཏིང་ངེ་འཛིན་འདི་སྟོན་པ་ན་དགེ་སློང་གཞན་དག་གིས་བསྟན་པ་ཐམས་ཅད་ལས་བསྙིལ་བར་གྱུར་ཏོ། །
en: When he taught this absorption all the other monks had completely strayed from the teachings.

source: དེ་ནས་ཆོས་སྨྲ་བ་དེ་ཞུམ་པ་མེད་པའི་སེམས་ཀྱིས་ལུས་དང་སྲོག་ལ་མི་བལྟ་བར། འདི་ལྟར་དུར་ཁྲོད་དུ་གནས་བཅས་ནས་
en: Nevertheless, this Dharma teacher was undeterred. Without concern for his own body and life, he inhabited charnel grounds,

source: རྩ་བ་དང་འབྲས་བུ་ཟ་ཞིང་ཏིང་ངེ་འཛིན་འདི་བསྟན་པའི་ཚེ།
en: living from roots and fruits, and thus he taught this absorption.

source: དེ་ལས་ཆོས་མཉན་པའི་ཕྱིར་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དག་ནས་བཟུང་སྟེ། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ལྷགས་སོ། །
en: At that point, the gods from the Heaven of the Four Great Kings through to the Unexcelled Heaven came to listen to his teachings.

source: དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་སྐྱེ་བོ་མང་པོ་མངོན་པར་དགའ་ཞིང་མྱ་ངན་མེད་པའི་ང་རོ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: At that time there was also a universal monarch known as Roar That Causes Widespread Happiness and Freedom from Pain,

source: དེས་ཆོས་སྨྲ་བ་དེ་ལས་ཏིང་ངེ་འཛིན་འདི་མཉན་ཏོ། །
en: who came to listen to that Dharma teacher’s explanation of this absorption.

source: མཉན་ནས་ཀྱང་ཆོས་སྨྲ་བ་དེ་ལ་མི་འཇིགས་པ་བྱིན་ཏེ། དགེ་སློང་སངས་རྒྱས་ཀྱིས་ཡང་དག་པར་བཀའ་སྩལ་པའི་ཏིང་ངེ་འཛིན་འདི་སྟོན་ཅིག །
en: When he had received the teaching, he gave the gift of freedom from terror as he said to the Dharma teacher, ‘Monk, please teach this absorption, which the buddhas have genuinely bestowed.
